[
  "There are 4.3 million software engineers in the US.",
  "One of the most famous software engineers is the creator of XML, Tim Bray.",
  "Only 10% of software engineers are part-time employees.",
  "73% of software engineers have a bachelor’s degree.",
  "Only 22% of all software engineers are female.",
  "The average base software engineer salary in the US is $120,000 a year.",
  "The unemployment rate for software engineers was only 1.9% in 2019.",
  "As of 2021, there are 4.3 million software engineers in the US.",
  "The top-paying metropolitan area in the US is San Jose-Sunnyvale-Santa Clara, CA, with an average annual salary of $145,730.",
  "The San Francisco-Oakland-Hayward, CA area is a very close second, with an average annual salary of $145,250.",
  "hird place goes to the Seattle-Tacoma-Bellevue, WA area, with a yearly salary of $134,090.",
  "According to software engineering statistics, the fourth place goes to the New York-Newark-Jersey City, NY-NJ-PA area, with an average annual salary of $122,230.",
  "And lastly, the fifth place goes to Battle Creek, MI, with an annual average wage of $121,160.",
  "The most used programming language worldwide as of 2021 is JavaScript, with 64.96% of developers and engineers using it.",
  "The second most used programming language is HTML/CSS, with 56.07% of programmers using it.",
  "After that, we have Python with a 48.24% share and SQL with a 47.08% share.",
  "One of the interesting facts about software engineering is that in 2020 and 2019, with 58% demand, the backend was the most sought-after role in the field.",
  "The second most sought-after role was full-stack development, with 57% of dedicated companies looking for specialists in the field.",
  "Front-end developers came next with 30% demand. These numbers come from more than 10,000 companies and 245,000 job seekers in North America and Europe.",
  "The top-paying non-metro area is the North Valley-Northern Mountains Region of CA, with an average annual salary of $125,010.",
  "In 2020, 69% of US employers struggled to fill positions, with tech positions being among the most challenging roles to fill.",
  "The most numerous subspeciality of software engineers is frontend developers, with a talent pool of over 463,000 members.",
  "The second most numerous subspeciality is backend developers, with a talent pool of over 400,000 members.",
  "The third most numerous subspeciality is full-stack developers, with a talent pool of over 300,000 members.",
  "Paul Buchheit developed the webmail service Gmail.",
  "John Carmack developed the computer games Doom and Quake.",
  "Dave Cutler developed Windows NT.",
  "Max Levchin created PayPal.",
  "Pierre Omidyar created eBay.",
  "Alexey Pazhitnov developed the computer game Tetris.",
  "Jimmy Wales made Wikipedia.",
  "Michael Widenius made the open-source database MySQL.",
  "Jamie Zawinski developed the web browser Netscape Navigator.",
  "There were over 26.2 million software developers in 2020.",
  "As of 2021, the most sought-after cloud platform is AWS, with 40.35% of devs expressing interest in using this technology.",
  "Employment for software engineers, developers, analysts, and testers is projected to grow by 22% from 2020 to 2030.",
  "The most sought-after software engineers are those that specialize in machine learning and data science.",
  "The top programming tool for all developers is Visual Studio, with 46.2% of developers using it in their projects.",
  "In 2021, the enterprise application software market made $271 billion worldwide.",
  "The average age of a software engineer is 34–44.",
  "The world’s first programmer was a woman. Ada Lovelace, born in the year 1815, was the world’s first programmer.",
  "Software engineers can be roughly grouped into six specialties: frontend, backend, full-stack, mobile, data science, and DevOps.",
  "San Francisco pays software engineers the most; Detroit, the least.",
  "Software engineers spend more time learning than other professionals.",
  "70% Of The Coding Jobs Has Nothing To Do With Technology At All.",
  "The First Ever Computer Game Made Zero Profit For Its Team Of Creators",
  "The Most Disliked Languages are Perl, Delphi, and VBA",
  "1 In 4 Developers Wrote The First Piece Of Code Before They Finished High School",
  "Most Developers Are Self Taught",
  "CAPTCHA Was Invented By Alan Turing"
]