[
  "A beautiful, smart, and loving person will be coming into your life.",
  "A dubious friend may be an enemy in camouflage.",
  "A faithful friend is a strong defense.",
  "A feather in the hand is better than a bird in the air.",
  "A fresh start will put you on your way.",
  "A friend asks only for your time not your money.",
  "You will have a great day!",
  "You will have a terrible day!",
  "You will have a good day!",
  "You will have a bad day!",
  "You will have a mediocre day!",
  "Might as well sleep in today.",
  "A friend is a present you give yourself.",
  "A gambler not only will lose what he has, but also will lose what he doesn’t have.",
  "A golden egg of opportunity falls into your lap this month.",
  "A good friendship is often more important than a passionate romance.",
  "A good time to finish up old tasks.",
  "A hunch is creativity trying to tell you something.",
  "A lifetime friend shall soon be made.",
  "A lifetime of happiness lies ahead of you.",
  "A light heart carries you through all the hard times.",
  "A new perspective will come with the new year.",
  "A person of words and not deeds is like a garden full of weeds.",
  "A pleasant surprise is waiting for you.",
  "A short pencil is usually better than a long memory any day.",
  "A small donation is call for. It’s the right thing to do.",
  "A smile is your personal welcome mat.",
  "You will find happiness with a new love.",
  "You will travel to many exotic places in your lifetime.",
  "Your shoes will make you happy today.",
  "You cannot love life until you live the life you love.",
  "Be on the lookout for coming events; They cast their shadows beforehand.",
  "Land is always on the mind of a flying bird .",
  "You will be called in to fulfill a position of high honor and responsibility.",
  "You will be traveling and coming into a fortune.",
  "Your ability for accomplishment will follow with success.",
  "Your ability to juggle many tasks will take you far.",
  "Your biggest virtue is your modesty.",
  "Your character can be described as natural and unrestrained.",
  "Your difficulties will strengthen you.",
  "Your dreams are never silly; depend on them to guide you.",
  "Your dreams are worth your best efforts to achieve them."
]