[
  "What do you call a fake noodle? An impasta.",
  "How many apples grow on a tree? All of them.",
  "What do you call a cow with two legs? Lean beef.",
  "Want to hear a joke about paper? Nevermind it's tearable.",
  "I just watched a program about beavers. It was the best dam program I've ever seen.",
  "What do you call a cow with four legs? A cow, because it has four legs.",
  "Why did the scarecrow win an award? Because he was outstanding in his field.",
  "Why did the coffee file a police report? It got mugged.",
  "How does a penguin build it's house? Igloos it together.",
  "Did you hear about the guy whose whole left side was cut off? He's all right now.",
  "Did you hear about the mathematician who's afraid of negative numbers? He'll stop at nothing to avoid them.",
  "What did the DNA say to the other DNA? “Do these genes make me look fat?”",
  "What does a baby computer call his father? Data.",
  "I just broke up with my mathematician girlfriend. She was obsessed with an X.",
  "What did the glass of wine say to the glass of beer? Nothing. They barley knew each other.",
  "Why do we tell actors to break a leg? Because every play has a cast.",
  "Dad, can you put the cat out? I didn't know it was on fire.",
  "What did the drummer call his twin daughters? Anna one, Anna two…",
  "What's the worst cat to have on your lap? Probably a bulldozer",
  "My dog used to chase people on a bike a lot. It got so bad I had to take his bike away.",
  "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
  "Do infants enjoy infancy as much as adults enjoy adultery?",
  "How are false teeth like stars? They come out at night!",
  "Why don’t eggs tell jokes? They’d crack each other up.",
  "Dad, did you get a haircut? No I got them all cut.",
  "What do you call a potato in space? Spudnik",
  "How do you spell Canda? C,eh,N,eh,D,eh",
  "What’s Forrest Gump’s password? 1forrest1.",
  " What do you call Santa’s little helpers? Subordinate clauses.",
  "Why is grass so dangerous? Because it’s full of blades.",
  "What do you call a hippie’s wife? Mississippi.",
  "What time did the kid go to the dentist yesterday? Tooth-hurty.",
  "Where do dads store their dad jokes? In the dad-a-base.",
  "What do you call a cow that has been treated badly? Beef jerky.",
  "This graveyard looks overcrowded. People must be dying to get in there.",
  "Why do crabs never give to charity? Because they're shellfish.",
  "What's a pirate's favorite letter? It be the Sea",
  "I was playing chess with my friend and he said, “Let’s make this interesting.” So we stopped playing chess.",
  "I hate it when people say age is only a number. Age is clearly a word.",
  "What’s green and has wheels? Grass. I lied about the wheels.",
  "I thought about going on an all-almond diet. But that's just nuts.",
  "Why do seagulls fly over the sea? Because if they flew over the bay they'd be bagels.",
  "What do you call a factory that sells passable products? A satisfactory.",
  "What do you call a cow that can't give milk? An udder failure.",
  "What’s the least spoken language in the world? Sign language.",
  "What do you call a cow that is not a cow? A chicken, because it is not a cow.",
  "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
  "I'm reading a book on the history of glue. I just can't seem to put it down.",
  "How do you count cows? A 'Cow'culator",
  "Doorbells, don't knock 'em.",
  "Whiteboards are remarkable.",
  "The rotation of earth really makes my day.",
  "I used to be a banker but I lost interest",
  "What do you call a pile of kittens? A meowntain.",
  "When the window fell into the incinerator, it was a pane in the ash to retrieve.",
  "Three guys walked into a bar. You'd think one of them would have seen it.",
  "What happened to the exorcist's car? It got repossessed.",
  "Where do cows go for entertainment? To the moovies.",
  "What do you call a bear with no teeth? A gummy bear.",
  "Where did Captain Hook get his hook? From the second-hand store.",
  " What is the most groundbreaking invention of all time? The shovel.",
  "What did one pirate say to the other when he beat him at chess? Checkmatey.",
  "I wondered why the baseball was getting bigger. Then it hit me.",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "Dad, can you put my shoes on? No, I don't think they'll fit me.",
  "What do you call a belt made out of watches? A waist of time.",
  "Did you hear they arrested the devil? Yeah, they got him on possession.",
  "I used to work in a shoe recycling shop. It was sole destroying.",
  "What does a house wear? Address.",
  "A steak pun is a rare medium well done.",
  "What do you call a sheep with no legs? A cloud.",
  "Anton, do you think I'm a bad mother? My name is Paul.",
  "I went to the doctor today and he told me I had type A blood, but it was a typo.",
  "What's worse than finding a worm in your apple? Finding half a worm.",
  "What’s a ninja’s favourite type of shoes? Sneakers",
  "I would avoid the sushi if I was you. It’s a little fishy.",
  "What do you call a cow that just gave birth? Decaffeinated.",
  "Why do you never see elephants hiding in trees? Because they're so good at it.",
  "What do you call a dog that does magic tricks? A labracadabrador.",
  "Astronomers got tired of watching the moon go round the earth for 24 hours, so they decided to call it a day.",
  "What do you call a Mexican who has lost his car? Carlos.",
  "Two guys walk into a bar, the third one ducks.",
  "What is Beethoven's favorite fruit? A ba-na-na-na.",
  "What do you call a fish with no eyes? A fsh.",
  "I don't trust stairs. They're always up to something.",
  "RIP, boiling water. You will be mist.",
  "I got fired from my job as a taxi driver. Turns out customers don't appreciate it when you go the extra mile.",
  "What's green and smells like red paint? Green paint.",
  "I'm so good at sleeping that I can do it with my eyes closed!",
  "What you call a Jamacian crimanal? Cinnamon.",
  "What do you call a sketchy Italian neighbourhood? The Spaghetto.",
  "What do you get when you cross a snowman with a vampire? Frostbite.",
  "Did you hear about the kidnapping at school? It's fine, he woke up!",
  "Why don't skeletons ever go trick or treating? Because they have no body to go with!",
  "I'm reading a book about anti-gravity. It's impossible to put down!",
  "Yesterday a clown held a door open for me. I thought it was a nice jester.",
  "What did the evil chicken lay? Deviled eggs.",
  "What’s an astronaut’s favorite part of the computer? The Space Bar.",
  "How does cereal pay its bills? With Chex."
]